app/views/twitter_apps/index.html.erb

SELECT  "location_tweets".* FROM "location_tweets"   ORDER BY "location_tweets"."id" ASC LIMIT 1 OFFSET 1
SELECT  "locations".* FROM "locations"   ORDER BY "locations"."id" DESC LIMIT 1
---
<script type="text/javascript">
for(i = 0; i < gon.arr_location_tweets.length; i++)