app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("created_at", "lat", "lon", "name", "string", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-24 22:36:42.139945"], ["lat", "40.675234"], ["lon", "-73.971043"], ["name", "Brooklyn"], ["string", ""], ["updated_at", "2014-11-24 22:36:42.139945"]]

  def update
    respond_to do |format|
      if @city.update(city_params)
---
UPDATE "cities" SET "display_name" = ?, "name" = ?, "updated_at" = ? WHERE "cities"."id" = 2  [["display_name", "New York"], ["name", "NewYork"], ["updated_at", "2014-11-26 03:01:40.195395"]]

  def destroy
    @city.destroy
---
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 7]]

    def set_city
      @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities"  WHERE "cities"."id" = ? LIMIT 1  [["id", 7]]