app/controllers/twitter_apps_controller.rb

SELECT  "cities".* FROM "cities"  WHERE "cities"."address" = 'Brooklyn' LIMIT 1
---
		gon.city_found = true

		#look up in DB
		@my_city = City.find_by address: @city_to_lookup

INSERT INTO "cities" ("address", "created_at", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "Tokyo"], ["created_at", "2014-11-28 20:21:22.437636"], ["latitude", 35.6894875], ["longitude", 139.6917064], ["updated_at", "2014-11-28 20:21:22.437636"]]
---
				c.latitude = s[0].latitude
				c.longitude = s[0].longitude
				c.address = @city_to_lookup
				c.save

INSERT INTO "locations" ("address", "created_at", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "amsterdam"], ["created_at", "2014-11-29 06:30:48.624218"], ["latitude", 52.3702157], ["longitude", 4.895167900000001], ["updated_at", "2014-11-29 06:30:48.624218"]]
---
			@twitter_rest_client.search(@topics, result_type: "recent", geocode: "#{@lat},#{@lon},#{@radius}mi").take(100).each do |tweet|
	  			#binding.pry
	  			if (tweet.geo?) then
					gon.arr_location_tweets<< Location_Tweet.new(tweet.text, tweet.geo.lat.to_f, tweet.geo.long.to_f, \
						tweet.retweeted? ? tweet.retweet_count : 0, tweet.created_at.to_datetime, tweet.media? ? tweet.media[0].media_url.to_s : "")